Nome_do_Arquivo=Nome do Arquivo
Dia=Dia
dia_=dia 
Erro=Erro
Salvar_em=Salvar em
Grafico_grf=Grafico (*.grf)
Buscar_arquivo=Buscar arquivo
Buscar_diretorio=Buscar diret\u00F3rio
Alerta=Alerta
Aviso=Aviso
Pergunta=Pergunta
Sim=Sim
Nao=N\u00E3o
un_dia=dia
un_area_foliar=\u00E1rea foliar
un_comp_galhos=comprimento de galhos
un_qtde_folhas=quantidade de folhas
TITULOPLANILHAESTAGIOINICIAL=Est\u00E1gio Inicial
TITULOPLANILHAESTAGIOFINAL=Est\u00E1gio Final
TITULODIALOGO=Procure o arquivo execut\u00E1vel do AMAPmod...
TITULOCOMBOITEM1=Est\u00E1gio 
TITULOCOMBOITEM2= - Dia 
TITULOCOMBOITEM3=Galho 
TITULOCOMBOITEM4=Nenhum Galho
TITULOCOMBOITEM5=Todos os Galhos
RESPOSTA_SIM=Sim, sem problemas
RESPOSTA_NAO=N\u00E3o desejo que salve por cima.
PERGUNTA1=J\u00E1 existe um arquivo no diret\u00F3rio 
PERGUNTA2= com o nome 
PERGUNTA3=!\nDeseja salvar por cima dele? (obs: o conte\u00FAdo do arquivo antigo ser\u00E1 perdido)
PERGUNTA4=Deseja localizar o interpretador de Python para poss\u00EDvel integra\u00E7\u00E3o no decorrer da execu\u00E7\u00E3o do programa?
AVISO1=Escolha um outro nome de arquivo ou apague-o, e tente novamente.
AVISO2=VPlants setado com sucesso!
AVISO3=VPlants encontrado com sucesso!
MENSAGEM1=Procure o arquivo execut\u00E1vel do VPlants...
ERRO1=Arquivo representando o est\u00E1gio inicial n\u00E3o existe!
ERRO2=Arquivo representando o est\u00E1gio final n\u00E3o existe!
ERRO3=N\u00E3o foi poss\u00EDvel reconhecer a topologia de MTG no arquivo 
ERRO4=Data definida para o segundo est\u00E1gio \u00E9 menor que a data definida para o primeiro est\u00E1gio!\nVerifique as datas declaradas nos arquivos MTG.
ERRO5=N\u00E3o h\u00E1 diferen\u00E7a entre a data definida para o est\u00E1gio inicial e a data definida para o est\u00E1gio final!\nNecessita de pelo menos 2 dias de diferen\u00E7a.\nVerifique as datas declaradas nos arquivos MTG.
ERRO6=Existe apenas um dia de diferen\u00E7a entre a data definida para o est\u00E1gio inicial e a data definida para o est\u00E1gio final!\nNecessita de pelo menos 2 dias de diferen\u00E7a. Verifique as datas declaradas nos arquivos MTG.
ERRO7=O MTG do arquivo 
ERRO8= n\u00E3o possui o n\u00FAmero de colunas necess\u00E1rias!\nNecessita ter pelo menos 20 colunas.
ERRO9= n\u00E3o encontrou a linha inicial de onde come\u00E7am os dados da topologia.\nVerifique no arquivo MTG se existe o texto 'ENTITY-CODE' e se a estrutura se inicia ap\u00F3s ele.
ERRO10=N\u00E3o existe data declarada no MTG do arquivo 
ERRO11=!\nNecessita ter uma data declarada na topologia do MTG.
ERRO12=Erro ao converter de String para Data!
ERRO13=Dia definido para este est\u00E1gio deve ter valor maior que 0.
ERRO14=Dia definido para este est\u00E1gio \u00E9 maior que o dia do est\u00E1gio final base! \nNecessita ter um dia menor.
ERRO15=N\u00E3o h\u00E1 diferen\u00E7a entre o dia definido para este est\u00E1gio e o dia do est\u00E1gio final base!\nNecessita ter um dia menor que a data do est\u00E1gio final base.
ERRO16=Este nome de arquivo j\u00E1 existe na tabela de MTGs a serem gerados.\nEscolha um outro nome.
ERRO17=Este dia j\u00E1 existe na tabela de MTGs a serem gerados.
ERRO18=Insira o nome do arquivo.
ERRO19=O valor a ser inserido no campo 'Dia a partir do est\u00E1gio inicial'\ndeve ser um n\u00FAmero inteiro.
ERRO20=Dia definido para este est\u00E1gio deve ter valor maior que 0.
ERRO21=Dia definido para este est\u00E1gio \u00E9 maior que o dia do est\u00E1gio final base!\nNecessita ter um dia menor.
ERRO22=N\u00E3o h\u00E1 diferen\u00E7a entre o dia definido para este est\u00E1gio e o dia do est\u00E1gio final base!\nNecessita ter um dia menor que a data do est\u00E1gio final base.
ERRO23=Incapaz de fechar o arquivo.
ERRO24=Arquivo n\u00E3o encontrado!
ERRO25=Tabela de MTGs a serem gerados est\u00E1 vazia.\nNecessita de pelo menos uma inser\u00E7\u00E3o na tabela.
ERRO26=Diret\u00F3rio entrado na caixa de texto n\u00E3o \u00E9 um diret\u00F3rio v\u00E1lido! Insira um diret\u00F3rio v\u00E1lido e tente novamente.
ERRO27=Diret\u00F3rio entrado na caixa de texto n\u00E3o existe! Insira um diret\u00F3rio v\u00E1lido e tente novamente.
ERRO28=Arquivo n\u00E3o existe!
ERRO29=N\u00E3o foi poss\u00EDvel visualizar o arquivo 
ERRO30=! Erro na convers\u00E3o de XLS para MTG.
ERRO31=Extens\u00E3o do arquivo n\u00E3o \u00E9 v\u00E1lida!\nExtens\u00E3o necessita ser MTG ou XLS.
ERRO32=Arquivo execut\u00E1vel a ser encontrado deve se chamar aml.
ERRO33=Caminho do arquivo setado no textbox n\u00E3o existe!
ERRO34=Erro ao converter a string '
ERRO35=' para data.
ERRO36=Arquivo 
ERRO37= n\u00E3o existe em 
ERRO38=Extens\u00E3o do arquivo 
ERRO39= n\u00E3o \u00E9 v\u00E1lida! Necessita ser xls ou mtg.
ERRO40=N\u00E3o foi poss\u00EDvel converter o arquivo 
ERRO41= em xls p/ poder gerar o arquivo com todas as plantas.
ERRO42=Arquivo execut\u00E1vel a ser encontrado deve se chamar aml.\nFalhou a tentativa de associar o VPlants ao programa.\nTente depois indo no menu ARQUIVO -> INTEGRA\u00C7\u00C3O VPLANTS.
ERRO43=N\u00E3o conseguiu encontrar o Python, portanto falhou a tentativa de associ\u00E1-lo ao programa.\nTente depois indo no menu ARQUIVO -> INTEGRA\u00C7\u00C3O VPLANTS.
ERRO44= !\nN\u00E3o encontrou o ANGULO ALFA DO TRONCO da planta no MTG.
ERRO45= !\nN\u00E3o encontrou o COMPRIMENTO DO TRONCO da planta no MTG.
ERRO46= !\nN\u00E3o encontrou o AMBIENTE da planta no MTG.
ERRO47= !\nN\u00E3o encontrou o SEXO da planta no MTG.
ERRO48= !\nN\u00E3o encontrou o valor de 'AlturaSup' na coluna 
ERRO49=, linha 
ERRO50= na topologia do MTG.
ERRO51= !\nN\u00E3o encontrou o valor de 'CompSRam' na coluna 
ERRO52= !\nN\u00E3o encontrou a sintaxe correta do suporte na coluna 
ERRO53= !\nN\u00E3o encontrou o valor de 'AlfaRamo' na coluna 
ERRO54= !\nN\u00E3o encontrou a sintaxe correta na coluna 
ERRO55= !\nN\u00E3o encontrou o valor do comprimento do entren\u00F3 na coluna 
ERRO56= !\nN\u00E3o encontrou a sintaxe correta dos atributos do entren\u00F3 na coluna 
ERRO57=Quantidade de entren\u00F3s da planta (na coluna 0) no est\u00E1gio inicial \u00E9 maior \nque a quantidade de entren\u00F3s da planta no est\u00E1gio final (na coluna 0).\nArrume o arquivos MTG e processe novamente.
ERRO58=O entren\u00F3 
ERRO59= da planta \u00E9 maior no est\u00E1gio inicial que no est\u00E1gio final!\nO valor pode ser menor ou igual, mas nunca maior.\nArrume o arquivo MTG e processe novamente.
ERRO60=Quantidade de suportes no est\u00E1gio inicial \u00E9 maior que no est\u00E1gio final.\nArrume o arquivo MTG e processe novamente.
ERRO61=Quantidade de entren\u00F3s do suporte 
ERRO62= no est\u00E1gio inicial \u00E9 maior que no est\u00E1gio final.\nArrume o arquivo MTG e processe novamente.
ERRO63= do suporte 
ERRO64= \u00E9 maior no est\u00E1gio inicial que no est\u00E1gio final!\nO valor pode ser menor ou igual, mas nunca maior.\nArrume o arquivo MTG e processe novamente.
ERRO65=Quantidade de galhos do suporte 
ERRO66=Quantidade de entren\u00F3s relativos (do eixo principal) do galho 
ERRO67=\ndo suporte 
ERRO68= (de ordem 
ERRO69=) do galho 
ERRO70= tem comprimento maior no est\u00E1gio inicial que no est\u00E1gio final.\nArrume o arquivo MTG e processe novamente.
ERRO71= tem unidade de crescimento maior no est\u00E1gio inicial que no est\u00E1gio final.\nArrume o arquivo MTG e processe novamente.
ERRO72= tem uma ramifica\u00E7\u00E3o no est\u00E1gio inicial maior que no est\u00E1gio final.\nArrume o arquivo MTG e processe novamente.
ERRO73= tem ramifica\u00E7\u00E3o no est\u00E1gio inicial, mas n\u00E3o\nno est\u00E1gio final. O entren\u00F3 deve ter a ramifica\u00E7\u00E3o tamb\u00E9m no est\u00E1gio final, ou ent\u00E3o n\u00E3o deve ter\na ramifica\u00E7\u00E3o no est\u00E1gio inicial. Arrume o arquivo MTG e processe novamente.
ERRO74=Arquivo de gr\u00E1fico inv\u00E1lido!
Estagio_Base_Inicial=Est\u00E1gio Base Inicial
Estagio_Base_Final=Est\u00E1gio Base Final
PLANTA_NO_ESTAGIO=* PLANTA NO EST\u00C1GIO 
GALHO=     #Galho 
RELATORIO1=Total de folhas:            
RELATORIO2=Folhas surgidas:            
RELATORIO3=Folhas ca\u00EDdas:              
RELATORIO4=\u00C1rea Foliar total (cm\u00B2):    
RELATORIO5=Ganho de \u00E1rea foliar (cm\u00B2): 
RELATORIO6=Comp. total de galhos (cm): 
RELATORIO7=Along de galhos (cm):       
RELATORIO8=Total de ramifica\u00E7\u00F5es:      
RELATORIO9=Ramifica\u00E7\u00F5es surgidas:      
RELATORIO10=Total de entren\u00F3s:          
RELATORIO11=Entren\u00F3s surgidos:          







